#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-WGUQNGokN8GVadNP

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_object.favicon: Refreshing state... [id=images/favicon.png]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_object.object: Refreshing state... [id=index.html]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_acm_certificate.cert: Drift detected (update)
aws_s3_bucket.s3_static_website: Drift detected (update)
aws_cloudfront_distribution.cdn: Drift detected (update)
aws_route53_record.www: Drift detected (update)
aws_s3_object.favicon: Drift detected (update)
aws_route53_record.dns: Drift detected (update)
aws_s3_object.object: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.favicon will be destroyed
  # (because aws_s3_object.favicon is not in configuration)
  - resource "aws_s3_object" "favicon" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "c7162f62f53cb9a279ccdfce9bebb086" -> null
      - force_destroy          = false -> null
      - id                     = "images/favicon.png" -> null
      - key                    = "images/favicon.png" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "src/images/favicon.png" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.object will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_s3_object" "object" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "49950a553e80f5a9da73b3c85939fff2" -> null
      - force_destroy          = false -> null
      - id                     = "index.html" -> null
      - key                    = "index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "src/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.object["index.html"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "49950a553e80f5a9da73b3c85939fff2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*